[
    {
        "Name": "Clueless",
        "Release_Date": "July 19, 1995 (USA) ",
        "Director": " Amy Heckerling",
        "Distributed_by": "Paramount Pictures",
        "Adapted_from": "Emma",
        "writter": "Amy Heckerling",
        "producer": "Scott Rudin , Robert Lawrence",
        "Music_by": "David Kitay",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/track/5lZAzpl6XoswhDz7BukTta?utm_source=generator&theme=0",
        "cast": "Alicia Silverstone as Cher Horowitz Stacey Dash as Dionne Davenport Brittany Murphy as Tai Frasier Paul Rudd as Josh Lucas Donald Faison as Murray Duvall Elisa Donovan as Amber Mariens Breckin Meyer as Travis Birkenstock",
        "story": "In the movie Clueless Cher a shallow wealthy, and socially adept high schooler, enjoys playing matchmaker. After successfully pairing off two teachers, she takes on the challenge of giving a makeover to Tai, a clumsy new student. However, when Tai surpasses her in popularity, Cher realizes her misguided approach. Her world crumbles, echoing the sentiments of her disapproving ex-stepbrother, with whom she unexpectedly falls in love.",
        "Poster": "posters/clueless.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "The Hangover ",
        "Release_Date": "June 5, 2009",
        "Director": "Todd Phillips ",
        "Distributed_by": "Warner Bros. Pictures ",
        "Adapted_from": "",
        "writter": "Jon Lucas Scott Moore",
        "producer": "Bill Brzeski",
        "Music_by": "Christophe Beck",
        "game": "openPopup2()",
        "game2": "Click me!!",
        "song": "https://open.spotify.com/embed/track/5XmRiEwyPantSj35Vx2UcQ?utm_source=generator",
        "cast": "Bradley Cooper as Phil Wenneck Ed Helms as Stu Price Zach Galifianakis as Alan Garner Justin Bartha as Doug Billings Heather Graham as Jade Ken Jeong as Leslie Chow",
        "story": "Three buddies wake up from a bachelor party in Las Vegas, with no memory of the previous night and the bachelor missing. They make their way around the city in order to find their friend before his wedding.",
        "Poster": "posters/hangover.webp",
        "home_button": "#intro"
    },
    {
        "Name": "Pretty woman ",
        "Release_Date": "March 23, 1990 (USA)",
        "Director": "Garry Marshall",
        "Distributed_by": "Touchstone Pictures, Walt Disney Studios Motion Pictures, Touchstone Home Entertainment",
        "Adapted_from": "NA",
        "writter": "Garry Marshall , J. F. Lawton",
        "producer": "Arnon Milchan , Steven Reuther , Gary W. Goldstein",
        "Music_by": " James Newton Howard",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/track/52HAHV1j93s5B8GoTNI7DJ?utm_source=generator",
        "cast": "Richard Gere Julia Roberts",
        "story": "In this modern update on Cinderella, a prostitute and a wealthy businessman fall hard for one another, forming an unlikely pair. While on a business trip in L.A., Edward (Richard Gere), who makes a living buying and breaking up companies, picks up a hooker, Vivian (Julia Roberts), on a lark. After Edward hires Vivian to stay with him for the weekend, the two get closer, only to discover there are significant hurdles to overcome as they try to bridge the gap between their very different worlds.",
        "Poster": "posters/prettywoman.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Someone great ",
        "Release_Date": "April 19, 2019",
        "Director": "Jennifer Kaytin Robinson",
        "Distributed_by": "Netflix",
        "Adapted_from": "NA",
        "writter": "Jennifer Kaytin Robinson",
        "producer": "Anthony Bregman , Peter Cron , Paul Feig",
        "Music_by": "Germaine Franco",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/playlist/0yLKraE05FzbaqLaMFvw0l?utm_source=generator",
        "cast": "Gina Rodriguez LaKeith Stanfield Brittany Snow",
        "story": "Dumped by her long-term boyfriend, a music journalist recruits her two best friends for one last outrageous adventure in New York City before she moves to San Francisco.",
        "Poster": "posters/someonegreat.jpg",
        "home_button": "#intro"
    },
    {
        "Name": "Letters to Juliet ",
        "Release_Date": "May 14, 2010 (USA)",
        "Director": "Gary Winick",
        "Distributed_by": "Summit Entertainment",
        "Adapted_from": "NA",
        "writter": "Tim Sullivan,  Jose Rivera",
        "producer": " Ellen Barkin ",
        "Music_by": "Andrea Guerra",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/track/1D4PL9B8gOg78jiHg3FvBb?utm_source=generator",
        "cast": "Amanda Seyfried - Sophie Christopher Egan as Charlie Wyman   Vanessa Redgrave as Claire Smith-Wyman Gael García Bernal as Victor Franco Nero as Lorenzo Bartolini",
        "story": "While visiting Verona, Italy, with her busy fiance, a young woman named Sophie (Amanda Seyfried) visits a wall where the heartbroken leave notes to Shakespeare's tragic heroine, Juliet Capulet. Finding one such letter from 1957, Sophie decides to write to its now elderly author, Claire (Vanessa Redgrave). Inspired by Sophie's actions, Claire sets out to find her long-lost lover, accompanied by her disapproving grandson (Christopher Egan) and Sophie.",
        "Poster": "posters/letterstojuliet.jpg",
        "home_button": "#intro"
    },
    {
        "Name": "Mamma mia",
        "Release_Date": "Jul 18, 2008  ",
        "Director": "Phyllida Lloyd",
        "Distributed_by": "Universal Pictures",
        "Adapted_from": "",
        "writter": "Catherine Johnson",
        "producer": "Judy Craymer, Gary Goetzman",
        "Music_by": "abba ",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/album/6QtnCAFmqOwR75jOOmU7k9?utm_source=generator",
        "cast": " Meryl Streep as Donna Sheridan, Amanda Seyfried as Sophie Sheridan, Pierce Brosnan as Sam Carmichael, Colin Firth as Harry Bright, Stellan Skarsgård as Bill Anderson, Christine Baranski as Tanya Chesham-Leigh, Julie Walters as Rosie Mulligan, and Dominic Cooper as Sky ",
        "story": "Donna (Meryl Streep), an independent hotelier in the Greek islands, is preparing for her daughter's wedding with the help of two old friends. Meanwhile Sophie, the spirited bride, has a plan. She secretly invites three men from her mother's past in hope of meeting her real father and having him escort her down the aisle on her big day.",
        "Poster": "posters/mammamia.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Valentines day ",
        "Release_Date": "February 12, 2010 ",
        "Director": " Garry Marshall",
        "Distributed_by": "Warner Bros., Warner Bros. Pictures, Warner Bros. Home Entertainment, Screen Gems",
        "Adapted_from": "NA",
        "writter": "Katherine Fugate; Abby Kohn; Marc Silverstein",
        "producer": "Mike Karz; Wayne Allan Rice",
        "Music_by": "WaterTower Big Machine",
        "game": "openPopup2()",
        "game2": "Click me!!",
        "song": "https://open.spotify.com/embed/track/2JoJrsEV15OzbijS47lids?utm_source=generator",
        "cast": "Jessica Alba as Morley Clarkson Kathy Bates as Susan Moralez Jessica Biel as Kara Monahan Bradley Cooper as Holden Wilson Eric Dane as Sean Jackson Patrick Dempsey as Dr. Harrison Copeland Hector Elizondo as Edgar Paddington Jamie Foxx as Kelvin Moore Jennifer Garner as Julia Fitzpatrick Topher Grace as Jason Morris Anne Hathaway as Liz Curran Ashton Kutcher as Reed Bennett Queen Latifah as Paula Thomas Taylor Lautner as Willy Harrington George Lopez as Alphonso Rodriguez, Shirley MacLaine as Estelle Paddington Emma Roberts as Grace Smart Julia Roberts as Captain Kate Hazeltine Taylor Swift as Felicia Miller",
        "story": "In a series of interconnected stories, various Los Angeles residents (Jessica Alba, Jessica Biel, Bradley Cooper) wend their way through the highs and lows of love during a single day. As the holiday unfolds, they experience first dates, longtime commitments, youthful crushes and connections to old flames.C16",
        "Poster": "posters/Valentines_Day_moive_poster.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Easy A ",
        "Release_Date": ": September 17, 2010 ",
        "Director": "Will Gluck",
        "Distributed_by": "Screen Gems, Sony Pictures Releasing",
        "Adapted_from": "The Scarlett Letter",
        "writter": "Bert V. Royal ",
        "producer": "Zanne Devine Will Gluck",
        "Music_by": "Brad Segal",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/track/0JowikaNr3ryhOo2gV8o4T?utm_source=generator",
        "cast": "Emma Stone as Olive Penderghast, Penn Badgley as Woodchuck Todd, Amanda Bynes as Marianne Bryant, Dan Byrd as Brandon, Thomas Haden Church as Mr. Griffith, Patricia Clarkson as Rosemary Penderghast, Cam Gigandet as Micah, Lisa Kudrow as Mrs. Griffith, and Malcolm McDowell as Principal Gibbons ",
        "story": "Prompted by her popular best friend to spill details of her boring weekend, Olive (Emma Stone), a clean-cut teen, decides to spice things up by telling a little lie about losing her virginity. When the high-school busybody (Amanda Bynes) overhears the conversation and spreads it all over campus, Olive is suddenly notorious but for the wrong reasons",
        "Poster": "posters/easya.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "LOL",
        "Release_Date": "May 4, 2012 ",
        "Director": "Lisa Azuelos",
        "Distributed_by": " Lionsgate, Lionsgate Films",
        "Adapted_from": " LOL (Laughing Out Loud)",
        "writter": "Lisa Azuelos , Kamir Aïnouz",
        "producer": "Double Feature Films",
        "Music_by": "Rob Simonsen",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/track/05xaXtqDCSFR9OLS5tL5oQ?utm_source=generator",
        "cast": " Miley Cyrus as Lola \"Lol\" Williams, Demi Moore as Anne Williams (Lol's mother), Douglas Booth as Kyle Ross, Ashley Greene as Ashley, Thomas Jane as Allen, Jay Hernandez as James, Adam G. Sevani as Max, Ashley Hinshaw as Emily, and George Finn as Chad ",
        "story": "In a world where connections via Facebook, Twitter and other social media networks are the norm, high-school student Lola (Miley Cyrus) is trying to navigate her way through the usual teen pressures of romance, friendship and overprotective parents (Demi Moore, Thomas Jane). Broken-hearted by a break-up with her boyfriend, Lola's world turns upside-down when she realizes that her best friend, Kyle (Douglas Booth), could actually be the love of her life.",
        "Poster": "posters/lol.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "The breakfast club",
        "Release_Date": "February 15, 1985 ",
        "Director": "John Hughes",
        "Distributed_by": "Universal Pictures, Universal Pictures Home Entertainment",
        "Adapted_from": "NA",
        "writter": "John Hughes",
        "producer": "John Hughes, Ned Tanen",
        "Music_by": "Keith Forsey",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/track/6yEAAIEHu4GcUFptg5W9kI?utm_source=generator",
        "cast": " Emilio Estevez as the Jock - Andrew Clark, Anthony Michael Hall as the Brain - Brian Johnson, Judd Nelson as the Criminal - John Bender, Molly Ringwald as the Princess - Claire Standish, and Ally Sheedy as the Basket Case - Allison Reynolds ",
        "story": "Five high school students from different walks of life endure a Saturday detention under a power-hungry principal (Paul Gleason). The disparate group includes rebel John (Judd Nelson), princess Claire (Molly Ringwald), outcast Allison (Ally Sheedy), brainy Brian (Anthony Michael Hall) and Andrew (Emilio Estevez), the jock. Each has a chance to tell his or her story, making the others see them a little differently -- and when the day ends, they question whether school will ever be the same.",
        "Poster": "posters/breakfastclub.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Notting hill ",
        "Release_Date": "May 28, 1999 ",
        "Director": "Roger Michell",
        "Distributed_by": "Universal Pictures, PolyGram Filmed Entertainment",
        "Adapted_from": "NA",
        "writter": "Richard Curtis",
        "producer": "Duncan Kenworthy",
        "Music_by": "Trevor Jones",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/track/0gcjc7Vt5xtcfmJgf6g2IO?utm_source=generator",
        "cast": " Anna Scott - Julia Roberts, William \"Will\" Thacker - Hugh Grant, Spike - Rhys Ifans, Honey Thacker - Emma Chambers, Max - Tim McInnerny, Bella - Gina McKee, Bernie - Hugh Bonneville, and Martin - James Dreyfus ",
        "story": "William Thacker (Hugh Grant) is a London bookstore owner whose humdrum existence is thrown into romantic turmoil when famous American actress Anna Scott (Julia Roberts) appears in his shop. A chance encounter over spilled orange juice leads to a kiss that blossoms into a full-blown affair. As the average bloke and glamorous movie star draw closer and closer together, they struggle to reconcile their radically different lifestyles in the name of love.",
        "Poster": "posters/nottinghill.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Devil wears prada ",
        "Release_Date": "June 30, 2006 ",
        "Director": "David Frankel",
        "Distributed_by": "20th Century Studios",
        "Adapted_from": "NA",
        "writter": "Lauren Weisberger",
        "producer": "Wendy Finerman",
        "Music_by": "Theodore Shapiro.",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/playlist/64aUUkGfdg2iGkRIteXFe3?utm_source=generator",
        "cast": " Miranda Priestly - Meryl Streep, Andrea \"Andy\" Sachs - Anne Hathaway, Emily Charlton - Emily Blunt, Nigel Kipling - Stanley Tucci, Christian Thompson - Simon Baker, and Nate Cooper - Adrian Grenier ",
        "story": "Andy (Anne Hathaway) is a recent college graduate with big dreams. Upon landing a job at prestigious Runway magazine, she finds herself the assistant to diabolical editor Miranda Priestly (Meryl Streep). Andy questions her ability to survive her grim tour as Miranda's whipping girl without getting scorched.",
        "Poster": "posters/devilwearsprada.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Juno ",
        "Release_Date": "December 25, 2007 ",
        "Director": "Jason Reitman",
        "Distributed_by": "Searchlight Pictures, FilmFlex",
        "Adapted_from": "NA",
        "writter": "Diablo Cody",
        "producer": "Lianne Halfon, John Malkovich, Mason Novick, Russell Smith",
        "Music_by": "Mateo Messina.",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/album/3Dm3Kc5oOFtesVJe5TF1HG?utm_source=generator",
        "cast": " Juno MacGuff - Ellen Page, Paulie Bleeker - Michael Cera, Vanessa Loring - Jennifer Garner, Mark Loring - Jason Bateman, Leah - Olivia Thirlby, Bren MacGuff - Allison Janney, and Mac MacGuff - J.K. Simmons ",
        "story": "When precocious teen Juno MacGuff (Ellen Page) becomes pregnant, she chooses a failed rock star and his wife (Jennifer Garner) to adopt her unborn child.",
        "Poster": "posters/juno.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Grownups ",
        "Release_Date": "June 25, 2010 ",
        "Director": "Dennis Dugan",
        "Distributed_by": "Columbia Pictures, Sony Pictures Releasing",
        "Adapted_from": "NA",
        "writter": "Adam Sandler Fred Wolf",
        "producer": "Adam Sandler; Jack Giarraputo",
        "Music_by": "Rupert Gregson-Williams",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/track/5IMtdHjJ1OtkxbGe4zfUxQ?utm_source=generator",
        "cast": " Lenny Feder - Adam Sandler, Eric Lamonsoff - Kevin James, Kurt McKenzie - Chris Rock, Marcus Higgins - David Spade, Rob Hilliard - Rob Schneider, and ",
        "story": "A single man who drinks too much. A father with three daughters who he rarely sees. A guy who is overweight and unemployed. A hen-pecked househusband. A successful Hollywood agent married to a fashion designer. What do these five men have in common? They used to play for the same basketball team at school. Now their former coach has died, and they are reunited at his funeral. Will the group rediscover old bonds?",
        "Poster": "posters/grownups.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Pitch perfect ",
        "Release_Date": "September 28, 2012 ",
        "Director": "Jason Moore",
        "Distributed_by": "Universal Pictures, Rogue Pictures",
        "Adapted_from": "NA",
        "writter": "Kay Cannon.",
        "producer": "Elizabeth Banks.",
        "Music_by": "Christophe Beck; Mark Kilian",
        "game": "",
        "game2": "",
        "song": "https://open.spotify.com/embed/playlist/7IajSNYbOrdzsm2SLAyDrw?utm_source=generator",
        "cast": " * Anna Kendrick as Beca Mitchell, * Skylar Astin as Jesse Swanson, * Rebel Wilson as Patricia \"Fat Amy\" Hobart, * Adam DeVine as Bumper Allen, * Anna Camp as Aubrey Posen, * Brittany Snow as Chloe Beale,, * Alexis Knapp as Stacie Conrad, * Ester Dean as Cynthia Rose Adams, * Hana Mae Lee as Lilly Onakuramara, * Ben Platt as Benji Applebaum, * Utkarsh Ambudkar as Donald, * Michael Viruet as Unicycle, * John Michael Higgins as John Smith, * Elizabeth Banks as Gail Abernathy-McKadden, and ",
        "story": "College student Beca (Anna Kendrick) knows she does not want to be part of a clique, but that's exactly where she finds herself after arriving at her new school. Thrust in among mean gals, nice gals and just plain weird gals, Beca finds that the only thing they have in common is how well they sing together. She takes the women of the group out of their comfort zone of traditional arrangements and into a world of amazing harmonic combinations in a fight to the top of college music competitions.",
        "Poster": "posters/pitchperfect.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Friday Night Plan ",
        "Release_Date": "September 1, 2023",
        "Director": "Vatsal Neelakantan",
        "Distributed_by": "Netflix",
        "Adapted_from": "NA",
        "writter": "Vatsal Neelakantan Sapan Verma",
        "producer": "Excel Entertainment",
        "Music_by": "Dhruv Vishvanath; Skrat; When Chai Met Toast; Background Score: Rahul Pais; Nariman Khambata; (The Jamroom)",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/Lz_jlyGDoqM?si=ypGg2D_jQSsgfvtn",
        "cast": " Babil Khan as Siddharth Menon, Amrith Jayan as Aditya Menon, Medha Rana as Natasha Sabharwal, Aadhya Anand as Nitya Sabharwal, Ninad Kamat as SI Suhas Pingale, Juhi Chawla as Maa, Aditya Jain as Kabir, Shashwat Chaturvedi as Bathtub, Vyom Vyas as Turk, Rishabh Joshi as Jay Sheth, and Mazda Taraporewala as Own Goal ",
        "story": "When their mother takes off on a business trip, two bickering brothers unite to secretly attend the hottest party of the year before she returns.",
        "Poster": "posters/fridaynightplan.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Kuch kuch hota hai",
        "Release_Date": "October 16, 1998",
        "Director": "Karan Johar",
        "Distributed_by": "Yash Raj Films",
        "Adapted_from": "NA",
        "writter": "Karan Johar",
        "producer": "Yash Johar",
        "Music_by": "Jatin-Lalit",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/OtGzATlvw_0?si=-fWPwAJdFkJbM6Lw",
        "cast": " Shah Rukh Khan as Rahul Khanna, Kajol as Anjali Sharma, Rani Mukerji as Tina Malhotra, Salman Khan as Aman Mehra, Sana Saeed as Anjali Khanna (Young), Parzan Dastur as Silent Sardarji (Ali), Reema Lagoo as Mrs. Khanna, Farida Jalal as Mrs. Sharma, Archana Puran Singh as Miss Briganza, Himani Shivpuri as Rifat Bi, Johnny Lever as Col. Almeida, and Anupam Kher as Principal Malhotra ",
        "story": "After reading the letter her mother had written for her before she died, Anjali decides to bring together her widowed father, Rahul, with his true love who is also named Anjali.",
        "Poster": "posters/kkhh.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Kabhi Khushi kabhi gham ",
        "Release_Date": "December 14, 2001",
        "Director": "Karan Johar",
        "Distributed_by": "Yash Raj Films",
        "Adapted_from": "NA",
        "writter": "Karan Johar",
        "producer": "Yash Johar",
        "Music_by": "Jatin-Lalit",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/7uY1JbWZKPA?si=BTnGhFHYFRB-hkoR",
        "cast": " Amitabh Bachchan as Yashvardhan \"Yash\" Raichand, Jaya Bachchan as Nandini Raichand, Shah Rukh Khan as Rahul Raichand, Kajol as Anjali Sharma, Hrithik Roshan as Rohan Raichand, Kareena Kapoor as Pooja \"Poo\" Sharma, Rani Mukerji as Naina Kapoor, Farida Jalal as Sayeeda, Alok Nath as Bauji (Bodhanand Gupta), Johnny Lever as Haldiram, Kavesh Majmudar as the young Rahul Raichand, and Sushma Seth as Daijaan ",
        "story": "Rahul (Shah Rukh Khan), the adoptive son of business magnate Yash Raichand (Amitabh Bachchan), feels eternal gratitude to his father for rescuing him from a life of poverty. Yet, when Yash forbids his love of poor Anjali (Kajol), Rahul marries her and moves to London with new wife and sister-in-law, Pooja (Kareena Kapoor), breaking the heart of his mother (Jaya Bachchan). Ten years later, Rahul's younger brother (Hrithik Roshan) comes to London intent on brokering peace between father and son.",
        "Poster": "posters/k3g.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Yeh jawani hai diwani ",
        "Release_Date": "May 31, 2013",
        "Director": "Ayan Mukerji",
        "Distributed_by": "UTV Motion Pictures",
        "Adapted_from": "NA",
        "writter": "Ayan Mukerji, Hussain Dalal",
        "producer": "Karan Johar, Hiroo Yash Johar",
        "Music_by": "Pritam",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/Rbp2XUSeUNE?si=wioZ5JAF2yzyMp-q",
        "cast": " Ranbir Kapoor as Kabir Thapar (Bunny), Deepika Padukone as Naina Talwar, Aditya Roy Kapoor as Avinash (Avi), Kalki Koechlin as Aditi, Kunaal Roy Kapur as Taran, Madhuri Dixit as Mohini, and Farooq Shaikh as Bunny's father ",
        "story": "Kabir and Naina bond during a trekking trip. Before Naina can express herself, Kabir leaves India to pursue his career. They meet again years later, but he still cherishes his dreams more than bonds.",
        "Poster": "posters/yjhd.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Kal ho na ho ",
        "Release_Date": "November 28, 2003",
        "Director": "Nikkhil Advani",
        "Distributed_by": "Dharma Productions, Yash Raj Films",
        "Adapted_from": "NA",
        "writter": "Karan Johar",
        "producer": "Yash Johar, Karan Johar",
        "Music_by": "Shankar-Ehsaan-Loy",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/tVMAQAsjsOU?si=L7nKWAAJOr0oiwNH",
        "cast": " Shah Rukh Khan as Aman Mathur, Preity Zinta as Naina Catherine Kapur, Saif Ali Khan as Rohit Patel, Jaya Bachchan as Jennifer Kapur, Sushma Seth as Lajjo Kapur, Reema Lagoo as Aman's mother, Lillete Dubey as Jaswinder \"Jazz\" Kapoor, and Delnaaz Irani as Jasprit \"Sweetu\" Kapoor ",
        "story": "Naina, an introverted, perpetually depressed girl's life changes when she meets Aman. But Aman has a secret of his own which changes their lives forever. Embroiled in all this is Rohit, Naina's best friend who conceals his love for her.",
        "Poster": "posters/kalhonaho.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Andhadhun",
        "Release_Date": "October 5, 2018",
        "Director": "Sriram Raghavan",
        "Distributed_by": "Viacom18 Motion Pictures",
        "Adapted_from": "NA",
        "writter": "Sriram Raghavan, Arijit Biswas, Pooja Ladha Surti, Yogesh Chandekar, Hemanth M. Rao",
        "producer": "Viacom18 Motion Pictures, Matchbox Pictures",
        "Music_by": "Amit Trivedi",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/2iVYI99VGaw?si=gCL-ROKlqfPJti42",
        "cast": " Ayushmann Khurrana as Akash Saraf, Tabu as Simi Sinha, Radhika Apte as Sofie Anil Dhawan as Pramod Sinha, Manav Vij as Inspector Manohar Jawanda, Ashwini Kalsekar as Mrs. Rasika Jawanda, Chhaya Kadam as Daani, Radhika's caretaker, Zakir Hussain as Dr. Swami, Rashmi Agdekar as Daani's friend, Mohini Kewalramani as Sophia Sinha, and Pratik Nandkumar More as Akash's assistant ",
        "story": "A series of mysterious events change the life of a blind pianist, who must now report a crime that he should technically know nothing of",
        "Poster": "posters/andhadhun.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Jaane tu ya jaane na ",
        "Release_Date": "July 4, 2008",
        "Director": "Abbas Tyrewala",
        "Distributed_by": "PVR Pictures",
        "Adapted_from": "NA",
        "writter": "Abbas Tyrewala",
        "producer": "Aamir Khan, Mansoor Khan",
        "Music_by": "A.R. Rahman",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/NYqqFeLzRiI?si=92O5ba-N2JcOHTPL",
        "cast": " Imran Khan as Jai Singh Rathore, Genelia Deshmukh as Aditi Mahant, Manjari Fadnnis as Meghna, Ayaz Khan as Sushant Modi, Karan Makhija as Rotlu, Sugandha Garg as Shaleen, Nirav Mehta as Jiggy, Alishka Varde as Bombs, Renuka Kunzru as Mala, Prateik Patil Babbar as Amit, Anuradha Patel as Pumpkin, Jayant Kripalani as Peachy, and Ratna Pathak Shah as Savitri ",
        "story": "A soft-spoken man and a hot-tempered woman are pushed to get married by their family and friends. Convinced that they are not suited, the best friends decide to seek out a soul mate for the other.",
        "Poster": "posters/jaanetu.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Zindagi na milegi dobara ",
        "Release_Date": "July 15, 2011",
        "Director": "Zoya Akhtar",
        "Distributed_by": "Eros International",
        "Adapted_from": "NA",
        "writter": "Reema Kagti, Zoya Akhtar",
        "producer": "Farhan Akhtar, Ritesh Sidhwani",
        "Music_by": "Shankar-Ehsaan-Loy",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/FJrpcDgC3zU?si=yd-Kt99YbfGvhmtG",
        "cast": " Hrithik Roshan as Arjun Saluja, Farhan Akhtar as Imran Qureshi, Abhay Deol as Kabir Dewan, Katrina Kaif as Laila, Kalki Koechlin as Natasha Arora, Naseeruddin Shah as Salman Habib, Deepti Naval as Salman's mother, Ariadna Cabrol as Nuria, Suhel Seth as Mr. Lall, Anisa as Selena, Mandi Sidhu as Ritu, and Dolly Ahluwalia as Smita Habib ",
        "story": "Three longtime friends embrace the \"carpe diem\" spirit during a bachelor retreat in Spain. Somewhere between adventure sports, tomato fights and flamenco, they conquer their fears and unresolved issues.",
        "Poster": "posters/znmd.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Dil dhadakne do ",
        "Release_Date": "June 5, 2015",
        "Director": "Zoya Akhtar",
        "Distributed_by": "Excel Entertainment, Junglee Pictures",
        "Adapted_from": "NA",
        "writter": "Zoya Akhtar, Reema Kagti",
        "producer": "Ritesh Sidhwani, Farhan Akhtar",
        "Music_by": "Shankar-Ehsaan-Loy",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/qfnJCv4_1Ts?si=eWCzOv8HcgCCN7Ih",
        "cast": " Anil Kapoor as Kamal Mehra, Shefali Shah as Neelam Mehra, Priyanka Chopra as Ayesha Mehra, Ranveer Singh as Kabir Mehra, Anushka Sharma as Farah Ali, Farhan Akhtar as Sunny Gill, Rahul Bose as Manav Sangha, Zarina Wahab as Manav's mother, Vikrant Massey as Rana Khanna, Ridhima Sud as Noorie Sood, Parmeet Sethi as Sunny's father, and Dolly Mattdo as Sunny's mother ",
        "story": "Members of a dysfunctional family invite their family and friends on a cruise to celebrate their parents' 30th anniversary, dealing with the impact of family on their romantic lives. ",
        "Poster": "posters/dildhadaknedo.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Jab we met ",
        "Release_Date": "October 26, 2007",
        "Director": "Imtiaz Ali",
        "Distributed_by": "Shree Ashtavinayak Cine Vision Ltd",
        "Adapted_from": "NA",
        "writter": "Imtiaz Ali",
        "producer": "Dhilin Mehta",
        "Music_by": "Pritam",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/Z6cE7g9feSs?si=Sg5hux14771vgISK",
        "cast": " Shahid Kapoor as Aditya Kashyap, Kareena Kapoor as Geet Dhillon, Dara Singh as Geet's grandfather, Pavan Malhotra as Geet's father, Saumya Tandon as Roop, Tarun Arora as Anshuman, Kamal Tiwari as Raj, Kiran Juneja as Aditya's mother, Nihar Thakkar as Aditya's father, Zenab Sheikh as Aditya's aunt, Tanvi Azmi as Geet's aunt, and Manmeet Singh as the conductor ",
        "story": "Aditya, a heartbroken tycoon on the verge of committing suicide, aimlessly boards a train. He meets Geet, a high-spirited girl who plans to elope with her lover, and finds himself pulled into her crazy life. ",
        "Poster": "posters/jabwemet.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Wake up sid ",
        "Release_Date": "October 2, 2009",
        "Director": "Ayan Mukerji",
        "Distributed_by": "Dharma Productions, UTV Motion Pictures",
        "Adapted_from": "NA",
        "writter": "Ayan Mukerji",
        "producer": "Hiroo Johar, Karan Johar",
        "Music_by": "Shankar-Ehsaan-Loy",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/Ngimy3GpHS0?si=1IBFQsrkjJN0BY4s",
        "cast": " Ranbir Kapoor as Sidharth \"Sid\" Mehra, Konkona Sen Sharma as Aisha Bannerjee, Anupam Kher as Ram Mehra, Supriya Pathak as Sarita Mehra, Rahul Khanna as Kabir Chaudhary, Namit Das as Rishi, Shikha Talsania as Laxmi, Kashmira Shah as Sonia, Kainaz Motivala as Tanya, and Shruti Bapna as debbie ",
        "story": "Sid Mehra (Ranbir Kapoor) is a young man living in Mumbai who benefits from the indulgence of his parents. After graduating from university, he makes a stab at working in his father's business, but lasts only a week. He then meets Aisha (Konkona Sen Sharma), an aspiring writer from Calcutta. Sid helps her get settled in the city and then wants to take things further -- but Aisha isn't interested because of Sid's slacker personality. Will her rejection serve as a wake-up call for Sid? ",
        "Poster": "posters/wakeupsid.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "3 idiots ",
        "Release_Date": "December 25, 2009",
        "Director": "Rajkumar Hirani",
        "Distributed_by": "Vinod Chopra Films, Reliance BIG Pictures",
        "Adapted_from": "NA",
        "writter": "Rajkumar Hirani, Abhijat Joshi",
        "producer": "Vidhu Vinod Chopra",
        "Music_by": "Shantanu Moitra",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/DKzBmRRdPXo?si=SqPEjcCmDmL0y8W7",
        "cast": " Aamir Khan as Ranchoddas \"Rancho\" Shamaldas Chanchad, R. Madhavan as Farhan Qureshi, Sharman Joshi as Raju Rastogi, Kareena Kapoor as Pia Sahastrabuddhe, Boman Irani as Dr. Viru Sahastrabuddhe (Virus), Omi Vaidya as Chatur Ramalingam (Silencer), Mona Singh as Mona Sahastrabuddhe, Parikshit Sahni as Mr. Qureshi, and Javed Jaffrey as Ranchoddas Shamaldas Chanchad (voiceover) ",
        "story": "Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them \"idiots\". ",
        "Poster": "posters/3idiots.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Dilwale Dulhania le jaayenge ",
        "Release_Date": "October 20, 1995",
        "Director": "Aditya Chopra",
        "Distributed_by": "Yash Raj Films",
        "Adapted_from": "NA",
        "writter": "Aditya Chopra",
        "producer": "Yash Chopra",
        "Music_by": "Jatin-Lalit",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/oIZ4U21DRlM?si=pNI7fYbb8qg9Vc-q",
        "cast": " Shah Rukh Khan as Raj Malhotra, Kajol as Simran Singh, Amrish Puri as Chaudhry Baldev Singh, Farida Jalal as Lajwanti \"Lajjo\" Singh, Anupam Kher as Dharamvir Malhotra, Satish Shah as Ajit Singh, Parmeet Sethi as Kuljeet Singh, Mandira Bedi as Preeti Singh, Himani Shivpuri as Kammo Kaur, Pooja Ruparel as Rajeshwari \"Chutki\" Singh, and Karan Johar as Rocky ",
        "story": "When Raj meets Simran in Europe, it isn't love at first sight but when Simran moves to India for an arranged marriage, love makes its presence felt. ",
        "Poster": "posters/ddlj.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Rocky aur rani ki prem kahani ",
        "Release_Date": "July 28, 2023",
        "Director": " Karan Johar",
        "Distributed_by": "Viacom18 Studios",
        "Adapted_from": "NA",
        "writter": "Shashank Khaitan , Sumit Roy , Ishita Moitra",
        "producer": "Karan Johar , hiroo johar , Apoorva Mehta",
        "Music_by": "Pritam Chakraborty",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/6mdxy3zohEk?si=6f3Dv_-cX3N27lBv",
        "cast": " Ranveer Singh as Rocky Randhawa, Alia Bhatt as Rani Chatterjee, Dharmendra as Kanwal Lund Randhawa, Shabana Azmi as Jamini Chatterjee, Jaya Bachchan as Dhanalaxmi Randhawa, Tota Roy Chowdhury as Chandon Chatterjee, Churni Ganguly as Anjali Chatterjee, Aamir Bashir as Tijori Randhawa, Kshitee Jog as Punam Randhawa, and Anjali Anand as Gayatri Randhawa (Golu) ",
        "story": "Flamboyant Punjabi Rocky and intellectual Bengali journalist Rani fall in love despite their differences. After facing family opposition, they decide to live with each other's families for three months before getting married.",
        "Poster": "posters/Rocky_Aur_Rani_Ki_Prem_Kahani.jpeg",
        "home_button": "#intro"
    },
    {
        "Name": "Dil chahta hai ",
        "Release_Date": "August 10, 2001",
        "Director": "Farhan Akhtar",
        "Distributed_by": "Excel Entertainment",
        "Adapted_from": "NA",
        "writter": "Farhan Akhtar",
        "producer": "Ritesh Sidhwani, Farhan Akhtar",
        "Music_by": "Shankar-Ehsaan-Loy",
        "game": "",
        "game2": "",
        "song": "https://www.youtube.com/embed/OBAcYSSUf6o?si=iBfLZusAbjfq7tkV",
        "cast": " Aamir Khan as Akash Malhotra, Saif Ali Khan as Sameer Mulchandani, Akshaye Khanna as Siddharth \"Sid\" Sinha, Preity Zinta as Shalini, Sonali Kulkarni as Pooja, Dimple Kapadia as Tara Jaiswal, Ayub Khan as Rohit Jaiswal, Rajat Kapoor as Mahesh, Suhasini Mulay as Sid's Mother, Suchitra Pillai as Priya Modi, Samantha Tremayne as Deepa, Ahmed Khan as Sameer's Father, ",
        "story": "inseparable childhood friends are just out of college. Nothing comes between them - until they each fall in love, and their wildly different approaches to relationships creates tension. ",
        "Poster": "posters/dil-chahta-hai.jpeg",
        "home_button": "#intro"
    }
]